/*1. Дано масив цілих чисел. Скориставшись покажчиками, поміняйте місцями елементи масиву 
з парними й непарними індексами (тобто ті елементи масиву, які стоять на парних місцях, 
поміняйте з елементами, які стоять на непарних місцях).
2. Дано два масиви, упорядковані за зростанням: А[n] та B[m]. Сформуйте масив C[n+m], 
що складається з елементів масивів А і В, упорядкований за зростанням. 
Використовуйте синтаксис покажчиків.
3. Дано два масиви: А[n] і B[m]. 
Необхідно створити третій масив, у якому потрібно зібрати:
■ Елементи обох масивів;
■ Загальні елементи двох масивів;
■ Елементи масиву A, які не включаються до B;
■ Елементи масиву B, які не включаються до A;
■ Елементи масивів A і B, які не є загальними для них (тобто об'єднання результатів двох попередніх варіантів).
Обов'язково використовуйте синтаксис покажчиків для цього завдання.*/
#include "Zagalne.h"

int main() {
	Random();
	const int N = 25, M = 30, NM = N + M;
	const int* pn = &N, * pm = &M, * pnm = &NM;
	int *par = nullptr, *par2 = nullptr, * par3 = nullptr, * pr = nullptr;
	int Arr[N], Arr2[M], Arr3[NM];
	par = Arr;
	par2 = Arr2;
	par3 = Arr3;
	int r = 0;
	pr = &r;
	while (true) {
		Vubir_Zadachu();
		Vvod(r);
		if (r == 4)break;
		Switch_Zadachu(pr, par, par2, par3, pn, pm, pnm);
	}
}