/*3. Дано два масиви: А[n] і B[m]. 
Необхідно створити третій масив, у якому потрібно зібрати:
■ Елементи обох масивів;
■ Загальні елементи двох масивів;
■ Елементи масиву A, які не включаються до B;
■ Елементи масиву B, які не включаються до A;
■ Елементи масивів A і B, які не є загальними для них (тобто об'єднання результатів двох попередніх варіантів).
Обов'язково використовуйте синтаксис покажчиків для цього завдання.*/
#pragma once
#include "Zagalne.h"

void Dii_z_tretim_masuvom(int* par, int* par2, int* par3, const int* pn, const int* pm, const int* pnm);