/*1. Дано масив цілих чисел. Скориставшись покажчиками, поміняйте місцями елементи масиву
з парними й непарними індексами (тобто ті елементи масиву, які стоять на парних місцях,
поміняйте з елементами, які стоять на непарних місцях).
2. Дано два масиви, упорядковані за зростанням: А[n] та B[m]. Сформуйте масив C[n+m],
що складається з елементів масивів А і В, упорядкований за зростанням.
Використовуйте синтаксис покажчиків.
3. Дано два масиви: А[n] і B[m].
Необхідно створити третій масив, у якому потрібно зібрати:
■ Елементи обох масивів;
■ Загальні елементи двох масивів;
■ Елементи масиву A, які не включаються до B;
■ Елементи масиву B, які не включаються до A;
■ Елементи масивів A і B, які не є загальними для них (тобто об'єднання результатів двох попередніх варіантів).
Обов'язково використовуйте синтаксис покажчиків для цього завдання.*/
#pragma once
#include<iostream>
#include<stdlib.h>
#include<time.h>
#define Show(A) std::cout<<A;
#define Vvod(A) std::cin>>A;
#define Default std::cout<<"Ne virno zroblenui vubir!";

void Random();
void Masuv_random(int *par, const int *pn);
void Show_masuv(int *par, const int *pn);
void Vubir_Zadachu();
void Switch_Zadachu(int* ps, int* par, int* par2, int* par3, const int* pn, const int* pm, const int* pnm);
