/*1. Використовуючи покажчики й оператор розіменування, визначити найбільше з двох чисел.
2. Використовуючи покажчики й оператор розіменування, визначити знак числа, введеного з клавіатури.
3. Використовуючи покажчики й оператор розіменування, поміняти місцями значення двох змінних.
4. Написати примітивний калькулятор, користуючись тільки покажчиками.
5. Використовуючи покажчик на масив цілих чисел, порахувати суму елементів масиву. 
Використовувати в програмі арифметику покажчиків для просування по масиву, а також оператор розіменування.*/
#include "Zagalne.h"

int main() {
	int v = 0, a = 0, b = 0;
	int* pa = &a, *pb = &b;
	Random;
	while (true) {
		if (v == 6)break;
		Vubir_zadachu();
		Vvod(v);
		Switch_zadachu(v, pa, pb);
		Show('\n');
	}
}
