/*1. Використовуючи покажчики й оператор розіменування, визначити найбільше з двох чисел.
2. Використовуючи покажчики й оператор розіменування, визначити знак числа, введеного з клавіатури.
3. Використовуючи покажчики й оператор розіменування, поміняти місцями значення двох змінних.
4. Написати примітивний калькулятор, користуючись тільки покажчиками.
5. Використовуючи покажчик на масив цілих чисел, порахувати суму елементів масиву.
Використовувати в програмі арифметику покажчиків для просування по масиву, а також оператор розіменування.*/
#pragma once
#include<iostream>
#include<stdlib.h>
#include<time.h>
#define Vvod(a)std::cin>>a;
#define Show(a)std::cout<<a;
#define Default std::cout<<"Ne virno zroblenui vubir!";
#define Random srand(time(NULL));
#define Random_chusla rand();

void Vubir_zadachu();
void Switch_zadachu(int a, int* x, int* y);

